Repository: nmakhmutov/Elwark.People
Catalog: src/Elwark.People.Api/Infrastructure/ErrorMessageResources.*.resx
Languages: ru

# AccountError:Blocked
source: Account with id '{0}' blocked until {1}. Reason: {2}
ru: Аккаунт с id '{0}' заблокирован до {1}. Причина: {2}.

# AccountError:NotFound
source: Account with id '{0}' not found.
ru: Аккаунт с id '{0}' не найдет.

# CommonError:Internal
source: Internal error
ru: Внутрення ошибка.

# CommonError:ModelState
source: Request data error
ru: Ошибка запроса.

# CommonError:NotSupported
source: Not supported
ru: Не поддерживается.

# CommonError:Unknown
source: Unknown error
ru: Неизвестная ошибка.

# ConfirmationError:AlreadySent
source: Confirmation already send. Please retry after {0}.
ru: Подтверждение было отправлено. Повторите запрос после {0}.

# ConfirmationError:Expired
source: Confirmation expired.
ru: Подтверждение истекло.

# ConfirmationError:Invalid
source: Confirmation has invalid format.
ru: Подтверждение имеет не валидный формат.

# ConfirmationError:NotFound
source: Confirmation not found.
ru: Подтверждение не найдено.

# ConfirmationError:NotMatch
source: Confirmation not match.
ru: Подтверждение не совпадает.

# CryptographyError:DecoderError
source: Cryptography decode error.
ru: Ошибка криптографии.

# CryptographyError:InvalidFormat
source: Invalid cryptography format.
ru: Неверный формат криптограции.

# CryptographyError:JsonError
source: Cryptography format error.
ru: Ошибка формата киптографии.

# CryptographyError:UnknownError
source: Unknown cryptography error.
ru: Неизвестная криптографическая ошибка.

# IdentificationError:AlreadyAdded
source: {0} identity {1} already added.
ru: {0} идентификатор {1} уже добавлен.

# IdentificationError:AlreadyConfirmed
source: {0} identity {1} already confirmed.
ru: {0} идентификатор {1} уже подтвержден.

# IdentificationError:AlreadyRegistered
source: {0} identity {1} already registered.
ru: {0} идентификатор {1} уже зарегистрирован.

# IdentificationError:Forbidden
source: {0} identity {1} forbidden.
ru: {0} идентификатор {1} запрешен.

# IdentificationError:NotConfirmed
source: {0} identity {1} not confirmed.
ru: {0} идентификатор {1} не подтвержден.

# IdentificationError:NotFound
source: {0} identity {1} not found.
ru: {0} идентификатор {1} не найден.

# NotificationError:Forbidden
source: Notification value is forbidden.
ru: Значение уведомления запрещено.

# PasswordError:Empty
source: Passwords must be filled
ru: Пароль должен быть заполен.

# PasswordError:Mismatch
source: Incorrect password.
ru: Некоректный пароль.

# PasswordError:NotSet
source: Password not set for account
ru: Пароль для аккаунта не задан.

# PasswordError:RequiresDigit
source: Passwords must have at least one digit ('0'-'9').
ru: Пароль должен состоять как минимум из одной цифры ('0' - '9').

# PasswordError:RequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
ru: В пароле должна быть хотя бы одна строчная буква ('a' - 'z').

# PasswordError:RequiresNonAlphanumeric
source: Passwords must have at least one non letter or digit character.
ru: Пароль должен содержать хотя бы один небуквенный или цифровой символ.

# PasswordError:RequiresUniqueChars
source: Passwords must have unique chars
ru: Пароль должен иметь уникальные символы.

# PasswordError:RequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
ru: Пароль должен состоять как минимум из одной заглавной буквы ('A' - 'Z').

# PasswordError:TooShort
source: Passwords must be at least 6 characters.
ru: Пароль должен состоять минимум из 6 символов.

# PasswordError:Worst
source: Password in list of worst passwords. Please use another password
ru: Пароль в списке худших паролей. Пожалуйста, используйте другой пароль.
